In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
0,1,3,male,22.0,1,0,7.2500,NaN,S,0
1,2,1,female,38.0,1,0,71.2833,C85,C,1
2,3,3,female,26.0,0,0,7.9250,NaN,S,1
3,4,1,female,35.0,1,0,53.1000,C123,S,1
4,5,3,male,35.0,0,0,8.0500,NaN,S,0

In [2]:
df.drop(['SibSp','Parch','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target=df.Survived
inputs=df.drop('Survived', axis='columns')

In [4]:
dummies= pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.drop(['Sex','male','Fare'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age  female
0       3  22.0       0
1       1  38.0       1
2       3  26.0       1

In [7]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(7)

   Pclass        Age  female
0       3  22.000000       0
1       1  38.000000       1
2       3  26.000000       1
3       1  35.000000       1
4       3  35.000000       0
5       3  29.881138       0
6       1  54.000000       0

In [9]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [10]:
len(X_train)

916

In [11]:
len(X_test)

393

In [12]:
len(inputs)

1309

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(X_train,y_train)

GaussianNB()

In [15]:
model.score(X_test,y_test)

0.8600508905852418

In [16]:
X_test[0:10]

      Pclass        Age  female
775        3  18.000000       0
1033       1  61.000000       0
1113       2  22.000000       1
579        3  32.000000       0
45         3  29.881138       0
376        3  22.000000       1
875        3  15.000000       1
1001       2  41.000000       0
357        2  38.000000       1
454        3  29.881138       0

In [17]:
y_test[0:10]

775     0
1033    0
1113    1
579     1
45      0
376     1
875     1
1001    0
357     0
454     0
Name: Survived, dtype: int64

In [18]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 0, 1, 1, 0, 1, 0], dtype=int64)

In [19]:
model.predict_proba(X_test[:10])

array([[0.95038825, 0.04961175],
       [0.68459792, 0.31540208],
       [0.02539957, 0.97460043],
       [0.9609406 , 0.0390594 ],
       [0.96049518, 0.03950482],
       [0.04559665, 0.95440335],
       [0.03694947, 0.96305053],
       [0.92712341, 0.07287659],
       [0.02855337, 0.97144663],
       [0.96049518, 0.03950482]])

In [20]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.8423913 , 0.89617486, 0.82513661, 0.84699454, 0.8579235 ])

In [21]:
inputs = pd.concat([inputs, tagets], axis='columns')

Exception in callback BaseSelectorEventLoop._read_from_self()
handle: <Handle BaseSelectorEventLoop._read_from_self()>
Traceback (most recent call last):
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\events.py", line 80, in _run
    self._context.run(self._callback, *self._args)
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\selector_events.py", line 120, in _read_from_self
    data = self._ssock.recv(4096)
ConnectionResetError: [WinError 10054] An existing connection was forcibly closed by the remote host
Exception in callback BaseSelectorEventLoop._read_from_self()
handle: <Handle BaseSelectorEventLoop._read_from_self()>
Traceback (most recent call last):
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\events.py", line 80, in _run
    self._context.run(self._callback, *self._args)
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\selector_events.py", line 120, in _read_from_self
    data = self._ssock.recv(4096)
ConnectionResetError: [WinError 10054] An existing connection was forcibly closed by the remote host

NameError: name 'tagets' is not defined

Exception in callback BaseSelectorEventLoop._read_from_self()
handle: <Handle BaseSelectorEventLoop._read_from_self()>
Traceback (most recent call last):
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\events.py", line 80, in _run
    self._context.run(self._callback, *self._args)
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\selector_events.py", line 120, in _read_from_self
    data = self._ssock.recv(4096)
ConnectionResetError: [WinError 10054] An existing connection was forcibly closed by the remote host
Exception in callback BaseSelectorEventLoop._read_from_self()
handle: <Handle BaseSelectorEventLoop._read_from_self()>
Traceback (most recent call last):
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\events.py", line 80, in _run
    self._context.run(self._callback, *self._args)
  File "C:\Users\arrow\AppData\Local\Programs\Python\Python39\lib\asyncio\selector_events.py", line 120, in _read_from_self
    data = self._ssock.recv(4096)
ConnectionResetError: [WinError 10054] An existing connection was forcibly closed by the remote host